app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
      id = params[:id] # retrieve movie ID from URI route
      @movie = Movie.find(id) # look up movie by unique ID

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
    def index
      if params[:ratings] != nil
        ratings = params[:ratings].keys
      else
        ratings = Movie.all_ratings
      end
      if params.key?("mt")
        sortstring = "title"
      elsif params.key?("rd")
        sortstring = "release_date"
      else
        sortstring = nil
      end
      if sortstring != nil
        @movies = Movie.with_ratings(ratings).order(sortstring)